posts/2022-07-13-cleanignore/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Using a .cleanignore File</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Using a .cleanignore File</h1>
</header><p>
Git offers a wide range of useful command line verbs besides the "usual"
suspects such as <code>add</code>, <code>commit</code>, <code>push</code> or <code>pull</code>. One of them is <a href="https://git-scm.com/docs/git-clean">git clean</a>,
which can be used to delete untracked files in a repository. This is useful when
you are trying to delete generated files, but can be annoying if your repository
contains user specific files which are not in version control. Visual Studio
creates directories such as <code>.vs</code>, or files like <code>*.user</code> and
<code>launchSettings.json</code> which contain IDE configuration which are only relevant
for a specific user. You can exclude these files from <code>git clean</code> using the <code>-x
-e &lt;expression&gt;</code> option:
</p>

<div class="org-src-container">
<pre class="src src-sh">git clean -dfx -e .vs/ -e *.user -e launchSettings.json
</pre>
</div>

<p>
These expressions looked similar to the content of a <code>.gitignore</code> file to me, so
I added a function to my <a href="/posts/2021-10-04-building-csharp">C# build tool</a> which feeds the content of a
<code>.cleanignore</code> file into <code>git clean</code>:
</p>

<div class="org-src-container">
<pre class="src src-text"># My .cleanignore file
.vs/
*.user
launchSettings.json
</pre>
</div>

<div class="org-src-container">
<pre class="src src-csharp">public static void Clean()
{
    var expressions = File.ReadLines(".cleanignore")
        .Select(l =&gt; l.Trim())
        .Where(l =&gt; !string.IsNullOrEmpty(l) &amp;&amp; !l.StartsWith("#"))
        .Select(l =&gt; $"-e {l}");

    Git(
        "clean -dfx",
        string.Join(' ', expressions));
}

private static void Git(params string[] arguments)
{
    // Run git using Process.Start
}
</pre>
</div>

<p>
You can find the code <a href="https://github.com/fwinkelbauer/chunkyard/blob/8c3c58efabb351296d46e6eab35c611d35a1a3ce/src/Chunkyard.Build/Commands.cs">here</a>.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2022-07-13</p>
<footer>
<p>Copyright 2023, Florian Winkelbauer. All rights reserved.</p>
</footer>
</div>
</body>
</html>